# Rappels

In [15]:
import pandas as pd 
df_titanic = pd.read_csv("../data/titanic.csv")
df_titanic.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [4]:
pd.pivot_table(df_titanic, index=["Sex", "Pclass"], values="Survived")

               Survived
Sex    Pclass
female 1       0.978723
       2       0.952381
       3       0.476190
male   1       0.365079
       2       0.131148
       3       0.113300

In [7]:
# Noter que le résultat précédent est équivalent à 
df_titanic.groupby(["Sex", "Pclass"])["Survived"].mean()

Sex     Pclass
female  1         0.978723
        2         0.952381
        3         0.476190
male    1         0.365079
        2         0.131148
        3         0.113300
Name: Survived, dtype: float64

In [14]:
pd.pivot_table(df_titanic, index=["Sex", "Pclass"], columns="Survived", values="Fare")

Survived                0           1
Sex    Pclass
female 1       151.550000  108.111863
       2        14.833333   22.559375
       3        18.735419   12.399493
male   1        64.145829   56.150179
       2        21.662159   21.592708
       3        12.781865   15.648703

In [17]:
pd.pivot_table(df_titanic, index=["Sex"], columns="Survived", values=["SibSp", "Parch"])

             Parch               SibSp
Survived         0         1         0         1
Sex
female    1.085106  0.566176  1.021277  0.573529
male      0.242063  0.430769  0.547619  0.430769

In [3]:
pd.crosstab(df_titanic.Sex, df_titanic.Survived)

Survived    0    1
Sex
female     45  134
male      263   58

# Exercices

In [16]:
# Proposer une visualisation pour connaître l'influence du lieu d'embarquement sur les chances de survie
pd.pivot_table(df_titanic, index=["Sex", "Pclass"], columns ="Embarked", values="Survived")

Embarked              C         Q         S
Sex    Pclass
female 1       0.976744  1.000000  0.958333
       2       1.000000  1.000000  0.910448
       3       0.652174  0.727273  0.375000
male   1       0.404762  0.000000  0.354430
       2       0.200000  0.000000  0.154639
       3       0.232558  0.076923  0.128302

In [17]:
df_titanic.groupby(["Sex", "Pclass", "Embarked"])["Survived"].agg("mean")

Sex     Pclass  Embarked
female  1       C           0.976744
                Q           1.000000
                S           0.958333
        2       C           1.000000
                Q           1.000000
                S           0.910448
        3       C           0.652174
                Q           0.727273
                S           0.375000
male    1       C           0.404762
                Q           0.000000
                S           0.354430
        2       C           0.200000
                Q           0.000000
                S           0.154639
        3       C           0.232558
                Q           0.076923
                S           0.128302
Name: Survived, dtype: float64

In [ ]:
# Bonus
# Proposer une visualisation pour confronter les lieus d'embarquement et les âges